let mainText = document.getElementById("mainText")
let namesInput = document.getElementById("namesInput")
let myThemesInput = document.getElementById("myThemes")
let myDaysInput = document.getElementById("myDays")

let allIsHere = `Усі були на уроці, молодці!`

let themes = {
    m1y1Web : `💡Вчора на занятті була пройдена тема: 
Розмітка простих об'єктів на HTML

Ми вивчили :
-Більш детально детально ознайомились з будовою Інтернету
-Вивчили як працювати з тегами (<a>, <img>, <h1>, <p>)

🌟 Нові знання нам допоможуть:
Краще розуміти як працювати з Інтернетом, та його інструментами, допоможуть навчитися створювати примітивні сторінки на мові html

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №1 Як влаштований Інтернет - доробити завдання до кінця
-Кружечок №2 Мова HTML - доробити завдання до кінця
*Завдання з зірочкою виконувати не обов'язково`,
    m1y2Web: `💡Вчора на занятті була пройдена тема: 
Розмітка простих об'єктів на HTML продовження

Ми вивчили :
-Повторили пройдений матеріал
-Розібралися з будовою адрес сайтів
-Вивчили нові атрибути

🌟 Нові знання нам допоможуть:
Краще розуміти як працювати з Інтернетом, та його інструментами, допоможуть навчитися створювати примітивні сторінки на мові html

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №3 Будова Інтернету. Продовження - доробити завдання до кінця
-Кружечок №4 Новий сайт-блог - доробити завдання до кінця
*Завдання з зірочкою виконувати не обов'язково`,
    m1y3Web: `💡Вчора на занятті була пройдена тема: 
Таблиці та їх оформлення

Ми вивчили :
-Повторили пройдений матеріал
-Навчились створювати таблиці на веб-сторінках
-Додавати межі

🌟 Нові знання нам допоможуть:
Додавати таблиці на веб сторінку, оформлювати та змінювати їх.

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №5 Створення таблиць, додавання меж`,
    m1y4Web: `Вчора на занятті була пройдена тема: 
Таблиці та їх оформлення продовження

Ми вивчили :
-Повторили пройдений матеріал
-Навчилися прибирати проміжки між межами та додавати межу рядків
-Навчилися додавати іконки в таблицю

🌟 Нові знання нам допоможуть:
Додавати таблиці на веб сторінку, оформлювати та змінювати їх.

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №6 Створення таблиць, повне оформлення`,
m1y5Web: ` 💡Вчора на занятті була пройдена тема: 
Стилі об'єктів різного типу

Ми вивчили :
-Повторили пройдений матеріал
-Вивчили нові стилі CSS (text-align, font-size, font-family)
-Вивчили нові теги <body>, <br/>

🌟 Нові знання нам допоможуть:
Стилізувати нашу сторінку та покращити оформлення сайту

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №7 Оформлення сторінок на CSS
-Кружечок №8 Об'єднання текста та картинок`,
m1y6Web: `💡Вчора на занятті була пройдена тема: 
Знайомство з GitHub. Публікація сторінки

Ми вивчили :
-Повторили пройдений матеріал
-Вивчили нові теги для створення «шапки» та «підвалу» (<header>, <footer>)
-Зареєструвалися на github
-Навчилися працювати на платформі github та публікувати сторінки

🌟 Нові знання нам допоможуть:
Навчитися оформляти сторінку за допомогою стилів CSS та публікувати за допомогою GitHub Pages.

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №9 Оформлення сторінки
-Кружечок №10 Git Hub Pages - інструмент публікації html-сторінок
*Завдання з зірочкою виконувати не обов'язково`,
m1y7Web : `💡Вчора на занятті була пройдена тема: 
Проєкт (індивідуальний)

Ми вивчили :
-Повторили пройдений матеріал
-Дізнались, що за тип сайту – лендінг
-Як задати посилання на розділи сайту
-Зробили власні сайти на вибрані теми

🌟 Нові знання нам допоможуть:
Покращити навички у створенні сайтів, та використати їх на практиці

📕ДОМАШНЯ ПРАКТИКА:  
-Кружечок №11 Підготовка проєкту HTML
-Кружечок №12 Доопрацювання проєкту`,
m1y8Web: `💡На уроці ми переконались в професійності наших учнів та вмінні використовувати знання з попередніх тем на практиці, а саме:

⚙️Використання тегів, для розташування різних об'єктів на сторінці
⚙️Управління стилями, за допомогою яких можна прикрашати сторінку
⚙️Публікація сайту, для викладання проєктів у загальний доступ

💡 В найближчих уроках нас чекає вивчення теми мова CSS та її можливості

📕 ДОМАШНЯ ПРАКТИКА:  
Повторити пройдений матеріал 
Допрацювати завдання які залишились невиконаними в минулих уроках, для закріплення пройденого матеріалу `,
m2y1Web: `💡Вчора на занятті була пройдена тема: 
Селектори за тегом

Ми вивчили:
- Повторили пройдений матеріал
- Познайомилися з мовою CSS а також її можливостями 
- Вивчили нові теги <head>, <link>
- Навчились працювати з селектором за тегом

🌟 Нові знання нам допоможуть:
Прискорювати працю з стилями та гнучкіше їх використовувати

📕ДОМАШНЯ ПРАКТИКА:
- Кружечок №1 Селектори за тегом
- Кружечок №2 Селектори за тегом. CSS-файл`,
    
    m2y2Web: `💡Вчора на занятті була пройдена тема: 
Контекстні селектори

Ми вивчили:
- Повторили пройдений матеріал
- Познайомились з новими CSS-стилями: text-decoration, border-radius, padding, margin

🌟 Нові знання нам допоможуть:
Навчитися ставити особливі стилі для об'єктів, що у спеціальних умовах

📕ДОМАШНЯ ПРАКТИКА:
- Кружечок №3 Контекстні селектори
- Кружечок №4 Нове оформлення об'єктів`,
    
    m2y3Web: `💡Вчора на занятті була пройдена тема: 
Каскадні таблиці стилів

Ми вивчили:
- Повторили пройдений матеріал
- Ознайомились з поняттям каскаду і пріоритетами селекторів

🌟 Нові знання нам допоможуть:
Навчитися визначати пріоритети стилів, які застосовуються у коді, навчитися застосовувати правило каскаду.

📕ДОМАШНЯ ПРАКТИКА:
- Кружечок №5 Правило каскаду
- Кружечок №6 Організуй стилі`,
    
    m2y4Web: `💡Вчора на занятті була пройдена тема: 
Селектор за класом

Ми вивчили:
- Повторили пройдений матеріал
- Навчилися використовувати селектори за класом
- Навчилися створювати навігацію

🌟 Нові знання нам допоможуть:
Навчитись використовувати та застосовувати селектори за класом для об'єктів, яким потрібне виняткове оформлення а також додавати на сайт навігацію

📕ДОМАШНЯ ПРАКТИКА:
- Кружечок №7 Селектори за класом
- Кружечок №8 Навігація та ще селектори за класом`,
    
    m2y5Web: `💡Вчора на занятті була пройдена тема: 
Підготовка до ВУ. Проєкт (індивідуальний)

Ми вивчили:
- Повторили пройдений матеріал
- Виконали проєкт оформлення сайту стилями

🌟 Нові знання нам допоможуть:
Покращити навички у створенні сайтів, та використати їх на практиці

📕ДОМАШНЯ ПРАКТИКА:
- Кружечок №9 Підготовка проєкту. Початок
- Кружечок №10 Підготовка проєкту. Підсумок`,
    
    m2y6Web: `💡На уроці ми переконались в професійності наших учнів та вмінні використовувати знання з попередніх тем на практиці, а саме:

⚙️Вміння користуватись мовою CSS та управляти селекторами
⚙️Управління стилями, за допомогою яких можна прикрашати сторінку
⚙️Публікація сайту, для викладання проєктів у загальний доступ

💡 В найближчих уроках нас чекає вивчення інструменту figma

📕 ДОМАШНЯ ПРАКТИКА:
Повторити пройдений матеріал 
Допрацювати завдання які залишились невиконаними в минулих уроках, для закріплення пройденого матеріалу`,
    
m1y3Web: `💡Вчора на занятті була пройдена тема:
Таблиці та їх оформлення

Ми вивчили:
-Повторили пройдений матеріал
-Навчились створювати таблиці на веб-сторінках
-Додавати межі

🌟 Нові знання нам допоможуть:
Додавати таблиці на веб сторінку, оформлювати та змінювати їх.

📕ДОМАШНЯ ПРАКТИКА:
-Кружечок №5 Створення таблиць, додавання меж`,

m3y1Web: `💡Вчора на занятті була пройдена тема:
Зображення для сайту

Ми вивчили:
-Повторили пройдений матеріал
-Дізнались, чим растрова графіка відрізняється від векторної
-Дізнались як не втратити якість растрового зображення
-Познайомились з графічним редактором Figma, його інструментами для створення малюнка, а також для оформлення зображень

🌟 Нові знання нам допоможуть:
Стилізувати нашу сторінку та покращити оформлення сайту

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №1 Конструктор зображень
-Кружечок №2 Створення іконок`,

m3y2Web: `💡Вчора на занятті була пройдена тема:
Зображення для сайту. Макети

Ми вивчили:
-Повторили пройдений матеріал
-Навчились планувати веб-сайт за допомогою макета
-Підбирати симетричне розташування об'єктів та поєднання кольорів

🌟 Нові знання нам допоможуть:
Стилізувати нашу сторінку та покращити оформлення сайту

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №3 Створення макету
-Кружечок №4 Виправлення макетів`,

m3y3Web: `💡Вчора на занятті була пройдена тема:
Види відступів та меж

Ми вивчили:
-Повторили пройдений матеріал
-Навчилися застосовувати до об'єкта відступи та межі різних типів
-Попрацювали з макетами та версткою за макетом

🌟 Нові знання нам допоможуть:
Стилізувати нашу сторінку та покращити оформлення сайту

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №5 Верстка: різні відступи
-Кружечок №6 Верстка. Межі`,

m3y4Web: `💡Вчора на занятті була пройдена тема:
Списки марковані та нумеровані

Ми вивчили:
-Повторили пройдений матеріал
-Навчились використовувати списки на сторінці HTML
-Задавати тип маркера
-Створювати багатосторінковий макет сайту і додавати на сторінки однаково стилізовані списки

🌟 Нові знання нам допоможуть:
Стилізувати нашу сторінку та покращити оформлення сайту

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №7 HTML-теги списків
-Кружечок №8 Списки та макети`,

m3y5Web: `💡Вчора на занятті була пройдена тема:
Проєкт (індивідуальний)

Ми вивчили:
-Повторили пройдений матеріал
-Виконали проект відповідно до обраної ролі

🌟 Нові знання нам допоможуть:
Поліпшити знання у створенні макетів або у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №9 Займуся дизайном
-Кружечок №10 Займуся версткою макету`,
m4y1Web: `💡Вчора на занятті була пройдена тема:
Контейнери. Знайомство

Ми вивчили:
-Повторили пройдений матеріал
-Навчитися об'єднувати об'єкти в блоки
-Задавати розмір блоків та керувати розміщенням блоків на сторінці

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №1 Блоки: розміри та стилі
-Кружечок №2 Керуй блоками`,
    
    m4y2Web: `💡Вчора на занятті була пройдена тема:
Види контейнерів

Ми вивчили:
-Повторили пройдений матеріал
-Навчитися застосовувати у розмітці теги, які відповідають призначенню блоку
-Навчитися застосовувати обкладинку для рядка: задаємо особливе оформлення
-Вивчили теги (span, aside, article, section)

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №3 Контейнери зі змістом
-Кружечок №4 Розмітка із змістом`,
    
    m4y3Web: `💡Вчора на занятті була пройдена тема:
Види контейнерів (Flexbox)

Ми вивчили:
-Повторили пройдений матеріал
-Навчились використовувати flex-контейнери для розміщення на сторінці об'єктів належним чином
-Вивчили стилі justify-content: flex-start|center|flex-end|space-between|space-around; flex-wrap

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №5 Флексбокси. Знайомство
-Кружечок №6 Флексбокси. Ускладнення`,
    
    m4y4Web: `💡Вчора на занятті була пройдена тема:
Проєкт (індивідуальний)

Ми вивчили:
-Повторили пройдений матеріал
-Покращили навички у створенні макету
-Покращили навички у написанні коду

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів та створенні макетів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №7 Робота над макетом
-Кружечок №8 Верстка сторінки`,
    m4y5Web: `💡На уроці ми переконались в професійності наших учнів та вмінні використовувати знання з попередніх тем на практиці, а саме:

⚙️Вміння користуватись мовою CSS та управляти селекторами
⚙️Створювати флекс бокси та керувати ними
⚙️Створення макету та робота з фігмою
⚙️Публікація сайту, для викладання проєктів у загальний доступ

💡 В найближчих уроках нас чекає вивчення професійної верстки

📕 ДОМАШНЯ ПРАКТИКА:  
Повторити пройдений матеріал 
Допрацювати завдання які залишились невиконаними в минулих уроках, для закріплення пройденого матеріалу`,
m5y1Web: `💡Вчора на занятті була пройдена тема:
Псевдокласи

Ми вивчили:
-Повторили пройдений матеріал
-Навчились використовувати псевдокласи для поліпшення зовнішнього вигляду об'єктів
-Вивчили псеводкласи (:hover, :focus, :visited, :first-child, :last-child)

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №1 Псевдокласи. Події миші
-Кружечок №2 Псевдокласи. Стилі нащадків`,

m5y2Web: `💡Вчора на занятті була пройдена тема:
Псевдоелементи

Ми вивчили:
-Повторили пройдений матеріал
-Навчились використовувати псевдоелементи для покращення зовнішнього вигляду сайту, акцентування важливих об'єктів.
-Вивчили псевдоелементи (::before, ::after)
-Розібрали застосування display: block | inline-block

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №3 Псевдоелементи. Знайомство
-Кружечок №4 Псевдоелементи. Ускладнення`,

m5y3Web: `💡Вчора на занятті була пройдена тема:
Абсолютне позиціонування

Ми вивчили:
-Повторили пройдений матеріал
-Навчилися використовувати позиціонування для покращення дизайну сайту
-Вивчили стилі (position:relative|absolute|fixed, top, left, right, bottom)

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №5 Позиціювання. Початок
-Кружечок №6 Позиціювання. Продовження`,

m5y4Web: `💡Вчора на занятті була пройдена тема:
Абсолютне позиціонування. Ускладнення

Ми вивчили:
-Повторили пройдений матеріал
-Навчилися створювати фігури за допомогою CSS та розміщувати їх

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №7 Намалюй фігури
-Кружечок №8 Позиціювання. Навігація`,

m5y5Web: `💡Вчора на занятті була пройдена тема:
Проєкт (індивідуальний)

Ми вивчили:
-Повторили пройдений матеріал
-Навчились додавати декорацію для сайту
-Підбирати потрібні ефекти та застосовувати їх

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №9 Проєкт. Декоративні елементи
-Кружечок №10 Проєкт. Доопрацювання, підсумки`,
m6y1Web: `💡Вчора на занятті була пройдена тема:
Лінійні градієнти

Ми вивчили:
-Повторили пройдений матеріал
-Навчились застосовувати лінійні градієнти та тіні для декоративного оформлення об'єктів на сайті
-Вивчили стилі box-shadow, background-image

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №1 Король тіней
-Кружечок №2 Змішуємо фарби`,

m6y2Web: `💡Вчора на занятті була пройдена тема:
Двовимірні трансформації

Ми вивчили:
-Повторили пройдений матеріал
-Навчились застосовувати двовимірні трансформації (плавна зміна стилів на площині) до об'єктів на сайті
-Вивчили стилі transform, transition

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №3 Введення у трансформації
-Кружечок №4 Додай рухів`,

m6y3Web: `💡Вчора на занятті була пройдена тема:
Розміщуємо відео та аудіо на сайті

Ми вивчили:
-Повторили пройдений матеріал
-Навчились застосовувати контейнер <iframe> для вставки мультимедійних об'єктів

🌟 Нові знання нам допоможуть:
Поліпшити знання у верстці сайтів

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №5 Відео на сайті
-Кружечок №6 Звук на сайті`,
m7y1Web: `💡Вчора на занятті була пройдена тема:
Підготовка до релізу 1 частина

Ми вивчили та зробили:
-Повторили пройдений матеріал
-Вибрали тему проекту
-Створили макет та дизайн сайту, який у наступних уроках учень програмуватиме

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №1 Створи дизайн сайту`,

m7y2Web: `💡Вчора на занятті була пройдена тема:
Підготовка до релізу 2 частина

Ми вивчили та зробили:
-Повторили пройдений матеріал
-Почали верстати сайт по зробленим макетам

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №2 Займусь кодом сайту`,

m7y3Web: `💡Вчора на занятті була пройдена тема:
Підготовка до релізу 3 частина

Ми вивчили та зробили:
-Повторили пройдений матеріал
-Продовжили верстати сайт по зробленим макетам

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №3 Фіналізація релізу`,
m1y1Front: `💡Вчора на занятті була пройдена тема:
Знайомство з HTML

Ми вивчили:
-Ознайомитись із базовими тегами
-Вивчити теги: head, body, header, main, footer.
-Розглянути структуру HTML-документа

🌟 Нові знання нам допоможуть:
Налаштувати учнів на вивчення курсу «Основи фронтенд-розробки». Познайомити дітей з основними тегами HTML

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 1:
-Кружечок №1 HTML. Початок
-Кружечок №2 Списки в HTML`,
    
    m1y2Front: `💡Вчора на занятті була пройдена тема:
Робота з текстом та зображеннями

Ми вивчили:
-Ознайомитись із базовими тегами
-Вивчили стильові властивості: color, background-color, border, font-size, font-family, width, height, text-align;
-Обговорили що таке блоковий елемент <div>

🌟 Нові знання нам допоможуть:
Вивчити додаткові можливості роботи з HTML

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 1:
-Кружечок №3 Атрибут style
-Кружечок №4 Тег div і властивість margin`,
    
    m1y3Front: `💡Вчора на занятті була пройдена тема:
Робота з таблицями

Ми вивчили:
-Ознайомитись із базовими тегами
-Вивчили теги: table, caption, tr, td
-Вивчили стильові властивості та значення: border-style, margin, padding;

🌟 Нові знання нам допоможуть:
Вивчити додаткові можливості роботи з HTML, розуміти структуру таблиць.

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 1:
-Кружечок №5 Стовпці та рядки
-Кружечок №6 Верстка календаря`,
    
    m1y4Front: `💡Вчора на занятті була пройдена тема:
Створення сайту-візитки

Ми вивчили:
-Створили сайт-візитку компанії

🌟 Нові знання нам допоможуть:
Покращили навички роботи з HTML

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 1:
-Кружечок №7 Вікторина. Модуль 1
-Кружечок №8 Створення сайту-візитки`,
m2y1Front: `💡Вчора на занятті була пройдена тема:
Селектори та класи

Ми вивчили:
-Основні принципи роботи з CSS
-Види селекторів та їх застосування

🌟 Нові знання нам допоможуть:
Покращити навички роботи з CSS

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 2:
-Кружечок №1 Основи CSS
-Кружечок №2 Класи та ідентифікатори. Принципи CSS`,
    
    m2y2Front: `💡Вчора на занятті була пройдена тема:
Контейнери

Ми вивчили:
-Види контейнерів у HTML
-Навчилися керувати положенням елементів за допомогою властивості position та застосовувати псевдокласи

🌟 Нові знання нам допоможуть:
Покращити навички роботи з CSS

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 2:
-Кружечок №3 Контейнери div і span
-Кружечок №4 Позиціонування елементів. Псевдокласи`,
    
    m2y3Front: `💡Вчора на занятті була пройдена тема:
Дизайн макета

Ми вивчили:
-Вивчили інструменти графічного редактора Figma
-Навчилися застосовувати сучасний спосіб розміщення елементів flexbox

🌟 Нові знання нам допоможуть:
Покращити навички роботи з CSS

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 2:
-Кружечок №5 Figma
-Кружечок №6 Flexbox`,
    
    m2y4Front: `💡Вчора на занятті була пройдена тема:
Створення стилів за макетом

Ми вивчили:
-Створили сторінку інтернет-магазину
-Узагальнили та систематизували матеріал другого модуля

🌟 Нові знання нам допоможуть:
Покращити навички роботи з CSS

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 2:
-Кружечок №7 Вікторина. Модуль 2
-Кружечок №8 Верстка сайту
-Кружечок №9 Форми в HTML`,
m3y1Front: `💡Вчора на занятті була пройдена тема:
Вступ у JavaScript

Ми вивчили:
-Розпочали вивчення мови JavaScript
-Дослідили DOM, змінні та взаємодію з об'єктами сторінки

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №1 Змінні
-Кружечок №2 Взаємодія зі сторінкою`,
    
    m3y2Front: `💡Вчора на занятті була пройдена тема:
Функції та події у JavaScript

Ми вивчили:
-Вивчили роботу функцій
-Навчилися програмувати відкладене виконання коду
-Навчилися обробляти базові події на прикладі сторінки стартапу

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №3 Galaxy: Функції
-Кружечок №4 Galaxy: Події`,
    
    m3y3Front: `💡Вчора на занятті була пройдена тема:
Керуючі конструкції

Ми вивчили:
-Розглянули логічний тип даних та логічні вирази
-Навчилися працювати з умовними операторами та циклом for

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №5 Galaxy: Умовні оператори
-Кружечок №6 Galaxy: Цикли та масиви`,
    
    m3y4Front: `💡Вчора на занятті була пройдена тема:
Об'єктно-орієнтоване програмування

Ми вивчили:
-Розглянули поняття класу та об'єкта
-Познайомилися з принципами роботи класів та об'єктів
-Застосували ці принципи в розв'язанні реальних задач

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №7 LogiBank: Об'єкти
-Кружечок №8 LogiBank: Класи`,
    
    m3y5Front: `💡Вчора на занятті була пройдена тема:
Анімація

Ми вивчили:
-Познайомилися зі способами створення анімацій у CSS і JavaScript
-Вивчили відповідні CSS-властивості та бібліотеку anime.js

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript та CSS

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №9 Анімація в CSS
-Кружечок №10 Анімація в JS`,
m3y6Front: `💡Вчора на занятті була пройдена тема:
Асинхронність і BOM

Ми вивчили:
-Познайомилися з принципами роботи асинхронного коду на прикладі setTimeout і anime.js
-Навчилися працювати з об'єктами Promise
-Вивчили поняття "середовище браузера" і BOM
-Ознайомилися з деякими об'єктами BOM і вивчили способи їх використання

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №11 Асинхронність
-Кружечок №12 Browser Object Model`,
    
    m3y7Front: `💡Вчора на занятті була пройдена тема:
Робота з рядками та cookie-файли

Ми вивчили:
-Познайомилися з основними методами рядків
-Вивчили принцип роботи cookie-файлів і навчилися гармонійно використовувати їх разом

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 3:
-Кружечок №13 Робота з рядками
-Кружечок №14 Cookie-файли`,
    
    m4y1Front: `💡Вчора на занятті була пройдена тема:
Проєкт "Квіз". Частина 1

На уроці було:
-Складено загальний план роботи над проєктом
-Виконали першу частину роботи над проєктом

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №1 Проєкт «Квіз». Планування
-Кружечок №2 Проєкт «Квіз». Реалізація`,
    
    m4y2Front: `💡Вчора на занятті була пройдена тема:
Проєкт "Квіз". Частина 2

На уроці було:
-Виконали другу частину роботи над проєктом

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №3 Проєкт «Квіз». Продовження`,
    
    m4y3Front: `💡Вчора на занятті була пройдена тема:
Проєкт "Квіз". Частина 3

На уроці було:
-Виконали третю частину роботи над проєктом

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №4 Проєкт «Квіз». Завершення`, 
m4y4Front: `💡Вчора на занятті була пройдена тема:
Проєкт "Квіз". Частина 4

На уроці було:
-Виконали фінальну частину роботи над проєктом

🌟 Нові знання нам допоможуть:
Покращити навички роботи з JavaScript

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 4:
-Кружечок №5 Проєкт «Квіз». Фінал`,
    
    m5y1Front: `💡Вчора на занятті була пройдена тема:
Система контролю версій

На уроці було:
-Вивчено поняття системи контролю версій
-Ознайомились із професійним інструментом для роботи з git — GitHub

🌟 Нові знання нам допоможуть:
Навчитися працювати з GIT

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №1 git і github
-Кружечок №2 Історія змін`,
    
    m5y2Front: `💡Вчора на занятті була пройдена тема:
Середовище розробки, консоль і розгалуження

На уроці було:
-Навчилися користуватися середовищем розробки VSCode
-Опанували основи керування git через консоль
-Вивчили нові можливості git

🌟 Нові знання нам допоможуть:
Навчитися працювати з GIT та VSCode

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №3 Середовище розробки та консоль
-Кружечок №4 Версії та гілки`,
    
    m5y3Front: `💡Вчора на занятті була пройдена тема:
Робота над груповим проєктом. Планування

На уроці було:
-Познайомилися з онлайн-платформою Miro
-Створили репозиторій нового проєкту в GitHub і розподілили завдання між учасниками команди

🌟 Нові знання нам допоможуть:
Навчитися працювати в команді

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №5 Планування додатка в Miro
-Кружечок №6 Синтаксис Markdown
-Кружечок №7 VSC. Підготовка репозиторію додатка`,
    
    m5y4Front: `💡Вчора на занятті була пройдена тема:
Робота над груповим проєктом. Макет

На уроці було:
-Дізналися, як створювати гарний UI
-Створили інтерактивний макет свого проєкту в команді

🌟 Нові знання нам допоможуть:
Навчитися працювати в команді

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №8 UX/UI
-Кружечок №9 Юзабіліті-тестування`,
m5y5Front: `💡Вчора на занятті була пройдена тема:
Робота над груповим проєктом. Верстка

На уроці було:
-Зверстали сторінку
-Зробили її адаптивною під мобільні пристрої

🌟 Нові знання нам допоможуть:
Навчитися працювати в команді

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №10 VSC: Верстка інтерфейсу
-Кружечок №11 Адаптивна верстка
-Кружечок №12 VSC: Адаптивна верстка`,

m5y6Front: `💡Вчора на занятті була пройдена тема:
Тестування та доопрацювання додатка

На уроці було:
-Написали функціонал додатка

🌟 Нові знання нам допоможуть:
Навчитися працювати в команді

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №13 Програмування логіки додатка`,

m5y7Front: `💡Вчора на занятті була пройдена тема:
Тестування та доопрацювання додатка

На уроці було:
-Дізналися, як проводити функціональне тестування
-Використали отримані знання для тестування свого додатка та завершили його розробку

🌟 Нові знання нам допоможуть:
Навчитися працювати в команді

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №14 Тестування додатка
-Кружечок №15 VSC: Доопрацювання додатка`,

m5y8Front: `💡Вчора на занятті була пройдена тема:
Хостинг і публікація

На уроці було:
-Дізналися поняття "домен", "хостинг" і "DNS-система"
-Опублікували підсумковий проєкт на GitHub Pages

🌟 Нові знання нам допоможуть:
Навчитися працювати в команді

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 5:
-Кружечок №16 Публікація`,

m6y1Front: `💡Вчора на занятті була пройдена тема:
Вершина дизайну

На уроці було:
-Вивчили 3D-трансформації

🌟 Нові знання нам допоможуть:
Покращити навички у верстці сторінок

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №1 CodePen: пошук, натхнення і створення
-Кружечок №2 3D-трансформації`,
m6y2Front: `💡Вчора на занятті була пройдена тема:
Вибір хостингу

На уроці було:
-Занурились у процес пошуку хостингу
-Опублікували сторінку на хостингу

🌟 Нові знання нам допоможуть:
Знайти найкращий хостинг згідно з вимогами

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №3 Вибір хостингу
-Кружечок №4 Робота з хостингом`,
    
    m6y3Front: `💡Вчора на занятті була пройдена тема:
Інструменти веб-аналітики

На уроці було:
-Дізналися, як працювати в Google Analytics

🌟 Нові знання нам допоможуть:
Навчитися працювати з Google Analytics

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №5 Google Analytics
-Кружечок №6 Метрики Google Analytics`,
    
    m6y4Front: `💡Вчора на занятті була пройдена тема:
Просування

На уроці було:
-Вивчили базові інструменти залучення в проєкт нової аудиторії

🌟 Нові знання нам допоможуть:
Рекламувати свій проєкт

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 6:
-Кружечок №7 Просування
-Кружечок №8 Соціальні мережі`,
    
    m7y1Front: `💡Вчора на занятті була пройдена тема:
Підготовка до Релізу. Урок 1

На уроці було:
-Зробили макет та спланували проєкт

🌟 Нові знання нам допоможуть:
Створювати професійні сайти

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №1 Планування роботи
-Кружечок №2 Дизайн-макет у Figmа`,
    
    m7y2Front: `💡Вчора на занятті була пройдена тема:
Підготовка до Релізу. Урок 2

На уроці було:
-Почали створювати проєкт у Github і VSCode

🌟 Нові знання нам допоможуть:
Створювати професійні сайти

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №3 Розробка у Github і VSCode`,
m7y3Front: `💡Вчора на занятті була пройдена тема:
Підготовка до Релізу. Урок 3

На уроці було:
-Написали функціонал за допомогою JavaScript

🌟 Нові знання нам допоможуть:
Створювати професійні сайти

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №4 Програмування функціоналу на JavaScript`,

m7y4Front: `💡Вчора на занятті була пройдена тема:
Підготовка до Релізу. Урок 4

На уроці було:
-Доопрацювали функціонал
-Доробили та опублікували проєкти

🌟 Нові знання нам допоможуть:
Створити професійний проєкт

📕ДОМАШНЯ ПРАКТИКА МОДУЛЬ 7:
-Кружечок №5 Доопрацювання додатка
-Кружечок №6 Опублікуй свій веб-додаток`
}

generateOptions(themes, "themes")

let mainButton = document.getElementById("mainButton")

mainButton.addEventListener("click", function(){
    let isMissing = document.querySelector('input[name="missing"]:checked');
    if(!checkIfEntered()){
        return
    }

    let reciever
    if(+isMissing.value){
        reciever = whoIsMissing()
    }else {
        //
        reciever = "Усі були на уроці, молодці!"
    }
    

    let text = `Добрий день, шановні батьки!☀️  

${reciever}

❗️Якщо виникнуть запитання по минулій темі, або потрібна допомога із виконанням домашньої практики - чекаємо Вас за півгодини до уроку в кімнаті google meet

${choseTheme()}

${choseDays()}

Усім бажаю мирного неба і продуктивного тижня💙💛`
    mainText.textContent  = text
    mainText.style.display = "block"
    // копирование в буфер
    navigator.clipboard.writeText(text)

})

function choseDays(){
    let primaryDays = {
        "ПН": "неділі",
        "ВТ": "понеділка",
        "СР": "вівторка",
        "ЧТ": "середи",
        "ПТ": "четверга",
        "СБ": "п'ятниці",
        "НД": "суботи"
    }
    let secondaryDays = {
        "ПН": "cуботу",
        "ВТ": "неділю",
        "СР": "понеділок",
        "ЧТ": "вівторок",
        "ПТ": "середу",
        "СБ": "четвер",
        "НД": "п'ятницю"
    }
    let primaryDay = primaryDays[myDaysInput.value]
    let secondaryDay = secondaryDays[myDaysInput.value]

    return `❗️ Нагадую, що практику потрібно зробити до ${primaryDay}. Чекатиму від кожного запитання у чаті на платформі і у чаті в Телеграмі.

🕧 Упродовж тижня я відповідаю на всі питання, на платформі.
✅ У ${secondaryDay} перевіряю домашнє завдання`
}
function checkIfEntered(){
    let isMissing = document.querySelector('input[name="missing"]:checked');
    let isSingle = document.querySelector('input[name="single"]:checked');
    let gender = document.querySelector('input[name="gender"]:checked');

    if (!isMissing) {
        alert("Оберіть, чи були відсутні учні!");
        return false;
    }

    if (+isMissing.value) { // Если кто-то отсутствовал
        if (!namesInput.value.trim()) {
            alert("Введіть імена відсутніх!");
            return false;
        }
        if (!isSingle) {
            alert("Виберіть, один учень або кілька!");
            return false;
        }
        if (+isSingle.value && !gender) { // Если один ученик - нужно выбрать пол
            alert("Виберіть стать відсутнього учня!");
            return false;
        }
    }

    if (!myThemesInput.value) {
        alert("Оберіть тему!");
        return false;
    }

    if (!myDaysInput.value) {
        alert("Оберіть день для здачі практики!");
        return false;
    }

    return true; // Если все ОК
}

function choseTheme(){
    return themes[myThemesInput.value]
}

function whoIsMissing(){
    let isSingle = document.querySelector('input[name="single"]:checked');
    let names
    if(namesInput.value){
        names = namesInput.value
    }else {
        return
    }

    let correctForm


    if(+isSingle.value){
        let gender = document.querySelector('input[name="gender"]:checked');
        if(gender.value == "Ч"){
            correctForm = "був відсутній"
        }else{
            correctForm = "була відсутня"
        }
    }else {
        correctForm = `були відсутні`
    }
    return `На уроці ${correctForm}: ${names}\n\nЗапрошую підключитись на наступний урок за півгодини раніше для відпрацювання теми, яку було пропущено, а також всіх, у кого виникнуть проблеми з виконанням домашньої практики.`
}

function generateOptions(themes, datalistId) {
    let datalist = document.getElementById(datalistId);
    datalist.innerHTML = ""; // Очищаем перед добавлением новых опций

    for (let key in themes) {
        let option = document.createElement("option");
        option.value = key;
        datalist.appendChild(option);
    }
}